
/******************************************************************************
 * 文件信息 :  
 *
 * 创 建 者 :  张旭
 *
 * 创建日期 :  2007.09.29
 * 
 * 原始版本 : 
 *     
 * 修改版本 :  
 *    
 * 修改日期 : 
 *
 * 修改内容 :
 * 
 * 审 核 者 :
 *
 * 附    注 :
 *
 * 描    述 :   源代码
 *
 * 版    权 :   南京长盛仪器有限公司 , Copyright Reserved
 * 
******************************************************************************/

/******************************************************************************
 *                              头文件卫士
******************************************************************************/ 
 
#ifndef    _CS5600C_INSTRUCTION_TABLE_H_
#define    _CS5600C_INSTRUCTION_TABLE_H_

#if defined(__cplusplus)

    extern "C" {     /* Make sure we have C-declarations in C++ programs */

#endif

/******************************************************************************
 *                             包含文件声明
******************************************************************************/ 


/******************************************************************************
 *                         文件接口数据结构体声明
******************************************************************************/

extern const ParserContainer                    t_ParserContainer_Root_CS8833[7];

extern const HeadScaleParserStruct              t_InstructionStruct_Source;

extern const HeadScaleParserStruct              t_InstructionStruct_System;

extern const HeadScaleParserStruct              t_InstructionStruct_Result;

/******************************************************************************
 *                            文件接口函数声明
******************************************************************************/






#if defined(__cplusplus)

    }

#endif 

/******************************************************************************
 *                             END  OF  FILE                                                                          
******************************************************************************/
		
#endif




		